backend: tensorflow
class_name: Sequential
config:
- class_name: Flatten
  config:
    batch_input_shape: !!python/tuple [null, 4]
    data_format: channels_last
    dtype: float32
    name: flatten_5
    trainable: true
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_10
    trainable: true
    units: 2
    use_bias: true
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {dtype: float32}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_11
    trainable: true
    units: 4
    use_bias: true
keras_version: 2.1.6-tf
